In [2]:
import pandas as pd

In [5]:
## series

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("series\n",series)

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
## create from dictionary elements

data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [7]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [10]:
## dataframe
## creating a dataframe from a dictionart of list

data={
  'name':('krish','john','jack'),
  'age':[25,30,45],
  'city':['banglore','new york','florida']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

    name  age      city
0  krish   25  banglore
1   john   30  new york
2   jack   45   florida
<class 'pandas.core.frame.DataFrame'>

In [11]:
import numpy as np
np.array(df)

array([['krish', 25, 'banglore'],
       ['john', 30, 'new york'],
       ['jack', 45, 'florida']], dtype=object)

In [5]:

import pandas as pd

data=[
  {'name':'krish','age':32,'city':'banglore'},
  {'name':'sandhya','age':34,'city':'mumbai'},
  {'name':'sayali','age':32,'city':'delhi'},
  {'name':'anu','age':32,'city':'delhi'}
        
]

df=pd.DataFrame(data)
print(df)
print(type(df))

      name  age      city
0    krish   32  banglore
1  sandhya   34    mumbai
2   sayali   32     delhi
3      anu   32     delhi
<class 'pandas.core.frame.DataFrame'>

In [8]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,OrderID,Date,Customer,Product,Category,Quantity,UnitPrice,TotalPrice,PaymentMethod,City
0,1001,2024-01-01,John Doe,Laptop,Electronics,1,800,800,Credit Card,New York
1,1002,2024-01-02,Jane Smith,Smartphone,Electronics,2,600,1200,PayPal,Los Angeles
2,1003,2024-01-03,Mike Johnson,Headphones,Accessories,3,50,150,Cash,Chicago
3,1004,2024-01-04,Emily Davis,Keyboard,Accessories,1,30,30,Debit Card,Houston
4,1005,2024-01-05,Chris Wilson,Tablet,Electronics,1,400,400,Credit Card,Phoenix

In [9]:
df.tail(5)

,OrderID,Date,Customer,Product,Category,Quantity,UnitPrice,TotalPrice,PaymentMethod,City
5,1006,2024-01-06,Anna Brown,Monitor,Electronics,2,200,400,PayPal,San Diego
6,1007,2024-01-07,David Lee,Mouse,Accessories,4,20,80,Cash,Seattle
7,1008,2024-01-08,Sophia Miller,Printer,Electronics,1,150,150,Debit Card,San Francisco
8,1009,2024-01-09,James Anderson,Desk Chair,Furniture,2,100,200,Credit Card,Dallas
9,1010,2024-01-10,Olivia Martinez,Webcam,Accessories,3,40,120,PayPal,Miami

In [13]:
## accessing data fron dataframes

df['Customer']

0           John Doe
1         Jane Smith
2       Mike Johnson
3        Emily Davis
4       Chris Wilson
5         Anna Brown
6          David Lee
7      Sophia Miller
8     James Anderson
9    Olivia Martinez
Name: Customer, dtype: object

In [16]:
df.loc[0]

OrderID                 1001
Date              2024-01-01
Customer            John Doe
Product               Laptop
Category         Electronics
Quantity                   1
UnitPrice                800
TotalPrice               800
PaymentMethod    Credit Card
City                New York
Name: 0, dtype: object

In [19]:
df.iloc[0][2]

C:\Users\sandh\AppData\Local\Temp\ipykernel_19508\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'John Doe'

In [23]:
## accessing specified elements

df.at[1,'City']

'Los Angeles'

In [24]:
df.at[2,'Customer']

'Mike Johnson'

In [26]:
## accessing specified elements
df.iat[2,3]

'Headphones'

In [34]:
import pandas as pd

# Sample DataFrame (your existing data)
data = {
    'name': ['krish', 'sandhya', 'sayali', 'anu'],
    'age': [32, 34, 32, 32],
    'city': ['banglore', 'mumbai', 'delhi', 'delhi']
}

df = pd.DataFrame(data)

# Adding the 'Salary' column
df['Salary'] = [5000, 6000, 5500, 5200]  # Ensure it matches the number of rows

print(df)

      name  age      city  Salary
0    krish   32  banglore    5000
1  sandhya   34    mumbai    6000
2   sayali   32     delhi    5500
3      anu   32     delhi    5200

In [38]:
df.drop('Salary',axis=1,inplace=True)

In [39]:
df

      name  age      city
0    krish   32  banglore
1  sandhya   34    mumbai
2   sayali   32     delhi
3      anu   32     delhi

In [40]:
## add age to the column
df['age']=df['age']+1
df

      name  age      city
0    krish   33  banglore
1  sandhya   35    mumbai
2   sayali   33     delhi
3      anu   33     delhi

In [41]:
df.drop(0)

      name  age    city
1  sandhya   35  mumbai
2   sayali   33   delhi
3      anu   33   delhi

In [42]:
df

      name  age      city
0    krish   33  banglore
1  sandhya   35    mumbai
2   sayali   33     delhi
3      anu   33     delhi

In [43]:
df.drop(0,inplace=True)

In [44]:
df

      name  age    city
1  sandhya   35  mumbai
2   sayali   33   delhi
3      anu   33   delhi

In [45]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,OrderID,Date,Customer,Product,Category,Quantity,UnitPrice,TotalPrice,PaymentMethod,City
0,1001,2024-01-01,John Doe,Laptop,Electronics,1,800,800,Credit Card,New York
1,1002,2024-01-02,Jane Smith,Smartphone,Electronics,2,600,1200,PayPal,Los Angeles
2,1003,2024-01-03,Mike Johnson,Headphones,Accessories,3,50,150,Cash,Chicago
3,1004,2024-01-04,Emily Davis,Keyboard,Accessories,1,30,30,Debit Card,Houston
4,1005,2024-01-05,Chris Wilson,Tablet,Electronics,1,400,400,Credit Card,Phoenix

In [47]:
print("datatypes:\n",df.dtypes)

print("statistical summary:\n",df.describe())

grouped=df.groupby('Category')['value'].mean()
print("mean value by Category:\n",grouped)

datatypes:
 OrderID           int64
Date             object
Customer         object
Product          object
Category         object
Quantity          int64
UnitPrice         int64
TotalPrice        int64
PaymentMethod    object
City             object
dtype: object
statistical summary:
           OrderID   Quantity  UnitPrice  TotalPrice
count    10.00000  10.000000   10.00000     10.0000
mean   1005.50000   2.000000  239.00000    353.0000
std       3.02765   1.054093  272.17029    374.2563
min    1001.00000   1.000000   20.00000     30.0000
25%    1003.25000   1.000000   42.50000    127.5000
50%    1005.50000   2.000000  125.00000    175.0000
75%    1007.75000   2.750000  350.00000    400.0000
max    1010.00000   4.000000  800.00000   1200.0000

KeyError: 'Column not found: value'

In [48]:
df.describe

<bound method NDFrame.describe of    OrderID        Date         Customer     Product     Category  Quantity  \
0     1001  2024-01-01         John Doe      Laptop  Electronics         1
1     1002  2024-01-02       Jane Smith  Smartphone  Electronics         2
2     1003  2024-01-03     Mike Johnson  Headphones  Accessories         3
3     1004  2024-01-04      Emily Davis    Keyboard  Accessories         1
4     1005  2024-01-05     Chris Wilson      Tablet  Electronics         1
5     1006  2024-01-06       Anna Brown     Monitor  Electronics         2
6     1007  2024-01-07        David Lee       Mouse  Accessories         4
7     1008  2024-01-08    Sophia Miller     Printer  Electronics         1
8     1009  2024-01-09   James Anderson  Desk Chair    Furniture         2
9     1010  2024-01-10  Olivia Martinez      Webcam  Accessories         3

   UnitPrice  TotalPrice PaymentMethod           City
0        800         800   Credit Card       New York
1        600        1200        PayPal    Los Angeles
2         50         150          Cash        Chicago
3         30          30    Debit Card        Houston
4        400         400   Credit Card        Phoenix
5        200         400        PayPal      San Diego
6         20          80          Cash        Seattle
7        150         150    Debit Card  San Francisco
8        100         200   Credit Card         Dallas
9         40         120        PayPal          Miami  >